samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/config.c
    ui32Rc = EEPROMProgram((uint32_t *)&g_sConfig, CFG_EEPROM_ADDR,
                           sizeof(tMQTTConfig));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (0x%x).\n", ui32Rc);
        return(false);
    }

    UARTprintf("MQTT config saved to EEPROM.\n");
    return(true);
}

//*****************************************************************************
//
// True if a broker host has been configured.
//
//*****************************************************************************
bool
ConfigHasBroker(void)
{
    return(g_sConfig.pcHost[0] != '\0');
}

//*****************************************************************************
//
// Per-input type accessors.  Bit i of g_sIOSettings.ui8InputType[] = 1 means
// input i is configured as a pushbutton (click-event); 0 = level switch.
//
//*****************************************************************************
bool
ConfigInputIsPushbutton(int iInput)
{
    if((iInput < 0) || (iInput >= CFG_MAX_INPUTS))
    {
        return(false);
    }
    return((g_sIOSettings.ui8InputType[iInput / 8] & (1u << (iInput % 8))) != 0);
}

void
ConfigSetInputPushbutton(int iInput, bool bPushbutton)
{
    if((iInput < 0) || (iInput >= CFG_MAX_INPUTS))
    {
        return;
    }
    if(bPushbutton)
    {
        g_sIOSettings.ui8InputType[iInput / 8] |= (uint8_t)(1u << (iInput % 8));
    }
    else
    {
        g_sIOSettings.ui8InputType[iInput / 8] &= (uint8_t)~(1u << (iInput % 8));
    }
}

//*****************************************************************************
//
// Persist the I/O settings to EEPROM.
//
//*****************************************************************************
bool
ConfigIOSave(void)
{
    uint32_t ui32Rc;

    g_sIOSettings.ui32Magic = CFG_IO_MAGIC;
    g_sIOSettings.ui32Crc = ConfigCRC32((const uint8_t *)&g_sIOSettings,
                                        sizeof(tIOSettings) - sizeof(uint32_t));

    ui32Rc = EEPROMProgram((uint32_t *)&g_sIOSettings, CFG_IO_EEPROM_ADDR,
                           sizeof(tIOSettings));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (IO settings, 0x%x).\n", ui32Rc);
        return(false);
    }

    UARTprintf("I/O settings saved to EEPROM.\n");
    return(true);
}

//*****************************************************************************
//
// Binding table accessors.  iInput in [0, CFG_MAX_INPUTS), iSlot in [0, CFG_BIND_SLOTS).
//
//*****************************************************************************
uint8_t
ConfigBindingGetTrigAct(int iInput, int iSlot)
{
    if((iInput < 0) || (iInput >= CFG_MAX_INPUTS) ||
       (iSlot < 0)  || (iSlot >= CFG_BIND_SLOTS))
    {
        return(0);
    }
    return(g_sBindings.ui8TrigAct[iInput * CFG_BIND_SLOTS + iSlot]);
}

uint8_t
ConfigBindingGetOutput(int iInput, int iSlot)
{
    if((iInput < 0) || (iInput >= CFG_MAX_INPUTS) ||
       (iSlot < 0)  || (iSlot >= CFG_BIND_SLOTS))
    {
        return(BIND_OUTPUT_NONE);
    }
    return(g_sBindings.ui8Output[iInput * CFG_BIND_SLOTS + iSlot]);
}

void
ConfigBindingSet(int iInput, int iSlot, uint8_t ui8TrigAct, uint8_t ui8Output)
{
    if((iInput < 0) || (iInput >= CFG_MAX_INPUTS) ||
       (iSlot < 0)  || (iSlot >= CFG_BIND_SLOTS))
    {
        return;
    }

    //
    // Reject a malformed slot: the trigger (bits 2:0) must be a known code and
    // the output must be a real relay index or BIND_OUTPUT_NONE.  Store anything
    // else as an unused slot so bad data (e.g. a hand-crafted /iocfg.cgi request)
    // can never drive relay logic.
    //
    if(((ui8TrigAct & 0x07u) > BIND_TRIG_CHANGE) ||
       ((ui8Output != BIND_OUTPUT_NONE) && (ui8Output >= CFG_MAX_OUTPUTS)))
    {
        ui8TrigAct = 0u;
        ui8Output  = BIND_OUTPUT_NONE;
    }

    g_sBindings.ui8TrigAct[iInput * CFG_BIND_SLOTS + iSlot] = ui8TrigAct;
    g_sBindings.ui8Output [iInput * CFG_BIND_SLOTS + iSlot] = ui8Output;
}

//*****************************************************************************
//
// Persist the binding table to EEPROM.
//
//*****************************************************************************
bool
ConfigBindingSave(void)
{
    uint32_t ui32Rc;

    g_sBindings.ui32Magic = CFG_IO_BINDINGS_MAGIC;
    g_sBindings.ui32Crc = ConfigCRC32((const uint8_t *)&g_sBindings,
                                      sizeof(tIOBindings) - sizeof(uint32_t));

    ui32Rc = EEPROMProgram((uint32_t *)&g_sBindings, CFG_IO_BINDINGS_ADDR,
                           sizeof(tIOBindings));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (bindings, 0x%x).\n", ui32Rc);
        return(false);
    }

    UARTprintf("Binding table saved to EEPROM.\n");
    return(true);
}

//*****************************************************************************
//
// OTA pending flag — a 2-word record at CFG_OTA_EEPROM_ADDR:
//   word 0: magic (OTA_EEPROM_MAGIC) when pending, else 0
//   word 1: firmware size in bytes
//
//*****************************************************************************
bool
ConfigOtaIsPending(void)
{
    uint32_t ui32Magic;
    EEPROMRead(&ui32Magic, CFG_OTA_EEPROM_ADDR, sizeof(uint32_t));
    return(ui32Magic == OTA_EEPROM_MAGIC);
}

void
ConfigOtaSetPending(uint32_t ui32Size)
{
    uint32_t aui32Rec[2] = { OTA_EEPROM_MAGIC, ui32Size };
    if(EEPROMProgram(aui32Rec, CFG_OTA_EEPROM_ADDR, sizeof(aui32Rec)) != 0)
    {
        UARTprintf("EEPROM write failed (OTA pending flag).\n");
    }
}

void
ConfigOtaClearPending(void)
{
    uint32_t aui32Rec[2] = { 0u, 0u };
    if(EEPROMProgram(aui32Rec, CFG_OTA_EEPROM_ADDR, sizeof(aui32Rec)) != 0)
    {
        UARTprintf("EEPROM write failed (OTA clear flag).\n");
    }
}

//*****************************************************************************
//
// ConfigFactoryReset — zero the magic word of every EEPROM record so that
// ConfigInit() on the next boot finds no valid data and falls back to the
// compiled-in defaults.  All four records are invalidated atomically-ish;
// power loss mid-way leaves at most some records at defaults, never corrupt.
//
//*****************************************************************************
void
ConfigFactoryReset(void)
{
    uint32_t ui32Zero = 0u;
    uint32_t ui32Rc   = 0u;
    ui32Rc |= EEPROMProgram(&ui32Zero, CFG_EEPROM_ADDR,      4);   // tMQTTConfig
    ui32Rc |= EEPROMProgram(&ui32Zero, CFG_IO_EEPROM_ADDR,   4);   // tIOSettings
    ui32Rc |= EEPROMProgram(&ui32Zero, CFG_IO_BINDINGS_ADDR, 4);   // tIOBindings
    ui32Rc |= EEPROMProgram(&ui32Zero, CFG_OTA_EEPROM_ADDR,  4);   // OTA flag
    ui32Rc |= EEPROMProgram(&ui32Zero, CFG_NTP_EEPROM_ADDR,  4);   // tNTPConfig
    ui32Rc |= EEPROMProgram(&ui32Zero, CFG_IO_NAMES_ADDR,    4);   // tIONames
    ui32Rc |= EEPROMProgram(&ui32Zero, CFG_OUTCFG_ADDR,      4);   // tOutputConfig
    ui32Rc |= EEPROMProgram(&ui32Zero, CFG_ROOMCFG_ADDR,     4);   // tRoomConfig
    if(ui32Rc != 0)
    {
        UARTprintf("Config: factory reset had EEPROM write error(s) (0x%x).\n",
                   ui32Rc);
    }
    else
    {
        UARTprintf("Config: EEPROM factory reset complete.\n");
    }
}

//*****************************************************************************
//
// Per-output mode accessors.
//
//*****************************************************************************
uint8_t
ConfigOutMode(int iOut)
{
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return(OUT_MODE_STANDARD); }
    return(g_sOutCfg.ui8Mode[iOut]);
}

void
ConfigSetOutMode(int iOut, uint8_t ui8Mode)
{
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return; }
    if(ui8Mode > OUT_MODE_TIMED) { ui8Mode = OUT_MODE_STANDARD; }
    g_sOutCfg.ui8Mode[iOut] = ui8Mode;
}

uint32_t
ConfigOutTimedMs(int iOut)
{
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return(1000u); }
    return(g_sOutCfg.ui32TimedMs[iOut]);
}

void
ConfigSetOutTimedMs(int iOut, uint32_t ui32Ms)
{
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return; }
    if(ui32Ms < 1u)          { ui32Ms = 1u; }
    if(ui32Ms > 3600000u)    { ui32Ms = 3600000u; }
    g_sOutCfg.ui32TimedMs[iOut] = ui32Ms;
}

//*****************************************************************************
//
// Shutter table accessors.
//
//*****************************************************************************
bool
ConfigShutterGet(int iSlot, uint8_t *pui8Up, uint8_t *pui8Down,
                 uint32_t *pui32TravelMs)
{
    if((iSlot < 0) || (iSlot >= CFG_MAX_SHUTTERS)) { return(false); }
    if(g_sOutCfg.ui8ShUp[iSlot] == SHUTTER_NONE)   { return(false); }
    if(pui8Up)        { *pui8Up        = g_sOutCfg.ui8ShUp[iSlot]; }
    if(pui8Down)      { *pui8Down      = g_sOutCfg.ui8ShDown[iSlot]; }
    if(pui32TravelMs) { *pui32TravelMs = g_sOutCfg.ui32ShTravelMs[iSlot]; }
    return(true);
}

void
ConfigShutterSet(int iSlot, uint8_t ui8Up, uint8_t ui8Down,
                 uint32_t ui32TravelMs)
{
    if((iSlot < 0) || (iSlot >= CFG_MAX_SHUTTERS)) { return; }

    //
    // Reject a dangerous/invalid pairing: the same relay for both directions, or
    // an index past the max output count.  Such a slot would let the shutter FSM
    // energize a relay it can never correctly release, so store it as empty.
    // (SHUTTER_NONE is 0xFF = CFG_MAX_OUTPUTS-out-of-range, so the empty-slot
    // path via ConfigShutterClear is unaffected — it sets both to SHUTTER_NONE.)
    //
    if((ui8Up == ui8Down) ||
       (ui8Up >= CFG_MAX_OUTPUTS) || (ui8Down >= CFG_MAX_OUTPUTS))
    {
        g_sOutCfg.ui8ShUp[iSlot]   = SHUTTER_NONE;
        g_sOutCfg.ui8ShDown[iSlot] = SHUTTER_NONE;
        return;
    }

    if(ui32TravelMs < 1u)       { ui32TravelMs = 1u; }
    if(ui32TravelMs > 3600000u) { ui32TravelMs = 3600000u; }
    g_sOutCfg.ui8ShUp[iSlot]        = ui8Up;
    g_sOutCfg.ui8ShDown[iSlot]      = ui8Down;
    g_sOutCfg.ui32ShTravelMs[iSlot] = ui32TravelMs;
}

void
ConfigShutterClear(int iSlot)
{
    if((iSlot < 0) || (iSlot >= CFG_MAX_SHUTTERS)) { return; }
    g_sOutCfg.ui8ShUp[iSlot]   = SHUTTER_NONE;
    g_sOutCfg.ui8ShDown[iSlot] = SHUTTER_NONE;
    memset(g_sOutCfg.pcShName[iSlot], 0, CFG_NAME_LEN);
}

