samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/config.c
const char *
ConfigShutterName(int iSlot)
{
    if((iSlot < 0) || (iSlot >= CFG_MAX_SHUTTERS)) { return(""); }
    return(g_sOutCfg.pcShName[iSlot]);
}

void
ConfigShutterNameSet(int iSlot, const char *pcName)
{
    if((iSlot < 0) || (iSlot >= CFG_MAX_SHUTTERS)) { return; }
    memset(g_sOutCfg.pcShName[iSlot], 0, CFG_NAME_LEN);
    if(pcName) { strncpy(g_sOutCfg.pcShName[iSlot], pcName, CFG_NAME_LEN - 1); }
}

int
ConfigShutterOfRelay(int iOut, bool *pbIsUp)
{
    int i;
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return(-1); }
    for(i = 0; i < CFG_MAX_SHUTTERS; i++)
    {
        if(g_sOutCfg.ui8ShUp[i] == SHUTTER_NONE) { continue; }
        if((int)g_sOutCfg.ui8ShUp[i] == iOut)
        {
            if(pbIsUp) { *pbIsUp = true; }
            return(i);
        }
        if((int)g_sOutCfg.ui8ShDown[i] == iOut)
        {
            if(pbIsUp) { *pbIsUp = false; }
            return(i);
        }
    }
    return(-1);
}

//*****************************************************************************
// Ensure no relay is used by more than one shutter (as UP or DOWN).  Two shutters
// sharing a relay would drive it from two independent FSMs with unsynchronised
// interlocks — a hardware-conflict path.  Any later slot that collides with an
// earlier valid one is emptied.  Returns the number of slots cleared.
//
//*****************************************************************************
static int
ConfigShutterDedup(void)
{
    bool    bUsed[CFG_MAX_OUTPUTS];
    int     iSlot, iCleared = 0;
    uint8_t ui8Up, ui8Dn;

    memset(bUsed, 0, sizeof(bUsed));
    for(iSlot = 0; iSlot < CFG_MAX_SHUTTERS; iSlot++)
    {
        ui8Up = g_sOutCfg.ui8ShUp[iSlot];
        ui8Dn = g_sOutCfg.ui8ShDown[iSlot];
        if((ui8Up >= CFG_MAX_OUTPUTS) || (ui8Dn >= CFG_MAX_OUTPUTS))
        {
            continue;                       // empty / invalid slot
        }
        if(bUsed[ui8Up] || bUsed[ui8Dn])
        {
            g_sOutCfg.ui8ShUp[iSlot]   = SHUTTER_NONE;
            g_sOutCfg.ui8ShDown[iSlot] = SHUTTER_NONE;
            iCleared++;
            continue;
        }
        bUsed[ui8Up] = true;
        bUsed[ui8Dn] = true;
    }
    return(iCleared);
}

//*****************************************************************************
//
// Persist the complete tOutputConfig record to EEPROM.
//
//*****************************************************************************
bool
ConfigOutputSave(void)
{
    uint32_t ui32Rc;
    int      iCleared;

    iCleared = ConfigShutterDedup();
    if(iCleared != 0)
    {
        UARTprintf("Config: cleared %d shutter(s) sharing a relay.\n", iCleared);
    }

    g_sOutCfg.ui32Magic = CFG_OUTCFG_MAGIC;
    g_sOutCfg.ui32Crc   = ConfigCRC32((const uint8_t *)&g_sOutCfg,
                                      sizeof(tOutputConfig) - sizeof(uint32_t));
    ui32Rc = EEPROMProgram((uint32_t *)&g_sOutCfg, CFG_OUTCFG_ADDR,
                           sizeof(tOutputConfig));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (output config, 0x%x).\n", ui32Rc);
        return(false);
    }
    UARTprintf("Output config saved to EEPROM.\n");
    return(true);
}

//*****************************************************************************
//
// Room / zone accessors.  Room index 0..CFG_MAX_ROOMS-1; ROOM_NONE = unassigned.
// A room is "defined" on the UI side when its name is non-empty.
//
//*****************************************************************************
const char *
ConfigRoomName(int iRoom)
{
    if((iRoom < 0) || (iRoom >= CFG_MAX_ROOMS)) { return(""); }
    return(g_sRoomCfg.pcRoomName[iRoom]);
}

void
ConfigRoomNameSet(int iRoom, const char *pcName)
{
    if((iRoom < 0) || (iRoom >= CFG_MAX_ROOMS)) { return; }
    memset(g_sRoomCfg.pcRoomName[iRoom], 0, CFG_NAME_LEN);
    if(pcName) { strncpy(g_sRoomCfg.pcRoomName[iRoom], pcName, CFG_NAME_LEN - 1); }
}

uint8_t
ConfigOutRoom(int iOut)
{
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return(ROOM_NONE); }
    return(g_sRoomCfg.ui8OutRoom[iOut]);
}

void
ConfigOutRoomSet(int iOut, uint8_t ui8Room)
{
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return; }
    g_sRoomCfg.ui8OutRoom[iOut] = (ui8Room < CFG_MAX_ROOMS) ? ui8Room : ROOM_NONE;
}

uint8_t
ConfigShRoom(int iShutter)
{
    if((iShutter < 0) || (iShutter >= CFG_MAX_SHUTTERS)) { return(ROOM_NONE); }
    return(g_sRoomCfg.ui8ShRoom[iShutter]);
}

void
ConfigShRoomSet(int iShutter, uint8_t ui8Room)
{
    if((iShutter < 0) || (iShutter >= CFG_MAX_SHUTTERS)) { return; }
    g_sRoomCfg.ui8ShRoom[iShutter] = (ui8Room < CFG_MAX_ROOMS) ? ui8Room : ROOM_NONE;
}

void
ConfigRoomSetDefaults(void)
{
    int i;
    memset(&g_sRoomCfg, 0, sizeof(tRoomConfig));
    g_sRoomCfg.ui32Magic = CFG_ROOMCFG_MAGIC;
    for(i = 0; i < CFG_MAX_OUTPUTS; i++)  { g_sRoomCfg.ui8OutRoom[i] = ROOM_NONE; }
    for(i = 0; i < CFG_MAX_SHUTTERS; i++) { g_sRoomCfg.ui8ShRoom[i]  = ROOM_NONE; }
}

bool
ConfigRoomSave(void)
{
    uint32_t ui32Rc;

    g_sRoomCfg.ui32Magic = CFG_ROOMCFG_MAGIC;
    g_sRoomCfg.ui32Crc   = ConfigCRC32((const uint8_t *)&g_sRoomCfg,
                                       sizeof(tRoomConfig) - sizeof(uint32_t));
    ui32Rc = EEPROMProgram((uint32_t *)&g_sRoomCfg, CFG_ROOMCFG_ADDR,
                           sizeof(tRoomConfig));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (room config, 0x%x).\n", ui32Rc);
        return(false);
    }
    UARTprintf("Room config saved to EEPROM.\n");
    return(true);
}

//*****************************************************************************
//
// NTP configuration accessors.
//
//*****************************************************************************
const tNTPConfig *
ConfigNtpGet(void)
{
    return(&g_sNTPConfig);
}

void
ConfigNtpSetServer(const char *pcServer)
{
    memset(g_sNTPConfig.pcServer, 0, CFG_NTP_SERVER_LEN);
    strncpy(g_sNTPConfig.pcServer, pcServer, CFG_NTP_SERVER_LEN - 1);
}

void
ConfigNtpSetTz(int8_t i8Offset)
{
    g_sNTPConfig.i8TzOffset = i8Offset;
}

//*****************************************************************************
//
// Channel name accessors and EEPROM update.
//
//*****************************************************************************
const char *
ConfigGetInputName(int iInput)
{
    if(iInput < 0 || iInput >= CFG_NAMES_MAX_INPUTS)
    {
        return("");
    }
    return(g_sIONames.pcInputNames[iInput]);
}

