samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/config.c
const char *
ConfigGetOutputName(int iOutput)
{
    if(iOutput < 0 || iOutput >= CFG_NAMES_MAX_OUTPUTS)
    {
        return("");
    }
    return(g_sIONames.pcOutputNames[iOutput]);
}

//
// Write one name entry to RAM, then do a targeted 12-byte EEPROM write plus
// a 4-byte CRC update — no full 1544-byte rewrite needed.
//
void
ConfigNameSet(bool bInput, int iIdx, const char *pcName)
{
    char     *pcDst;
    uint32_t ui32Addr;
    uint32_t ui32Rc;

    if(bInput)
    {
        if(iIdx < 0 || iIdx >= CFG_NAMES_MAX_INPUTS) { return; }
        pcDst    = g_sIONames.pcInputNames[iIdx];
        ui32Addr = CFG_IO_NAMES_ADDR + 4u +
                   (uint32_t)iIdx * CFG_NAME_LEN;
    }
    else
    {
        if(iIdx < 0 || iIdx >= CFG_NAMES_MAX_OUTPUTS) { return; }
        pcDst    = g_sIONames.pcOutputNames[iIdx];
        ui32Addr = CFG_IO_NAMES_ADDR + 4u +
                   CFG_NAMES_MAX_INPUTS * CFG_NAME_LEN +
                   (uint32_t)iIdx * CFG_NAME_LEN;
    }

    memset(pcDst, 0, CFG_NAME_LEN);
    strncpy(pcDst, pcName, CFG_NAME_LEN - 1);

    // Persist the magic word on every targeted write so the record survives a
    // reboot even if ConfigNamesSave() was never called (e.g. after factory reset).
    // The CRC is written LAST: if power is lost before it lands, the record fails
    // CRC on next boot and self-heals to blank names (rather than trusting stale
    // data).  All three writes are checked so a hardware failure is at least logged.
    ui32Rc  = EEPROMProgram(&g_sIONames.ui32Magic, CFG_IO_NAMES_ADDR, 4u);
    ui32Rc |= EEPROMProgram((uint32_t *)(uintptr_t)pcDst, ui32Addr, CFG_NAME_LEN);

    g_sIONames.ui32Crc = ConfigCRC32((const uint8_t *)&g_sIONames,
                                      sizeof(tIONames) - sizeof(uint32_t));
    ui32Rc |= EEPROMProgram(&g_sIONames.ui32Crc,
                  CFG_IO_NAMES_ADDR + sizeof(tIONames) - sizeof(uint32_t), 4u);
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (name %d, 0x%x).\n", iIdx, ui32Rc);
    }
}

bool
ConfigNamesSave(void)
{
    uint32_t ui32Rc;
    g_sIONames.ui32Magic = CFG_IO_NAMES_MAGIC;
    g_sIONames.ui32Crc   = ConfigCRC32((const uint8_t *)&g_sIONames,
                                        sizeof(tIONames) - sizeof(uint32_t));
    ui32Rc = EEPROMProgram((uint32_t *)&g_sIONames, CFG_IO_NAMES_ADDR,
                           sizeof(tIONames));
    return(ui32Rc == 0);
}

bool
ConfigNtpSave(void)
{
    uint32_t ui32Rc;
    g_sNTPConfig.ui32Magic = CFG_NTP_MAGIC;
    g_sNTPConfig.ui32Crc   = ConfigCRC32((const uint8_t *)&g_sNTPConfig,
                                          sizeof(tNTPConfig) - sizeof(uint32_t));
    ui32Rc = EEPROMProgram((uint32_t *)&g_sNTPConfig, CFG_NTP_EEPROM_ADDR,
                           sizeof(tNTPConfig));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (NTP config, 0x%x).\n", ui32Rc);
        return(false);
    }
    UARTprintf("NTP config saved to EEPROM.\n");
    return(true);
}
